import streamlit as st

#ส่วนที่ 1 หัวข้อหน้าเว็บ (Title สีแดง)
st.markdown("# :red[🏋️ คำนวนค่าดัชนีมวลกาย BMI]")
st.write("กรอกข้อมูลน้ำหนักและส่วนสูงของคุณ เพื่อเช็กสุขภาพเบื้องต้น")

#ส่วนที่ 2 สร้างช่องรับค่าน้ำหนัก และ ส่วนสูง
weight = st.number_input("กรอกน้ำหนักของคุณ (กิโลกรัม):", min_value=1.0)
height_cm = st.number_input("กรอกส่วนสูงของคุณ (เซ็นติเมตร):", min_value=1.0)

#ส่วนที่ 3 สร้างปุ่มกดคำนวน
if st.button("คำนวนค่า BMI 🎯"):
   # แปลงส่วนสูงจาก cm เป็น เมตร แล้วคำนวน BMI
   height_m = height_cm / 100
   bmi = weight / (height_m ** 2)

   st.write(" - - -")
   st.header(f"ค่า BMI ของคุณคือ: **{bmi:.2f}**")

#ส่วนที่ 4 แปลผลค่า BMI ตามเกณฑ์
if bmi < 18.5:
   st.warning("⚠️ คุณมีน้ำหนักน้อยกว่าเกณฑ์ (ผอม)")
elif 18.5 <= bmi < 23.0:
   st.success("🎉 คุณมีน้ำหนักอยู่ในเกณฑ์ปกติ (สุขภาพดี)")
elif 23.0 <= bmi < 25.0:
   st.info("💡 คุณเริ่มมีน้ำหนักเกินในเกณฑ์ (ท้วม)")
else:
   st.error("🚨 คุณอยู่ในเกณฑ์อ้วน ควรระวังเรื่องสุขภาพและออกกำลังกาย")

st.divider()
st.write("นางสาวอริสรา ธัชช์ชยกุล เลขที่ 4 ม.4/3")
